# St7GetHRABaseCombinationFactor

Returns the result factor for the Base Displacement, Base Velocity or Base Acceleration case in harmonic time
results.

long St7GetHRABaseCombinationFactor(long uID, double* Factor)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Factor

Factor value.